---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GlobalParameterFailures.ElementPropLinkCircularChain
source: html/aafedd2e-5c01-7598-8b6c-4806929eaef9.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GlobalParameterFailures.ElementPropLinkCircularChain Property

Linked properties in highlighted elements cause a circular chain of references.

## Syntax (C#)
```csharp
public static FailureDefinitionId ElementPropLinkCircularChain { get; }
```